import math                                                             # Импортириуем библиотеку математических вычислений

print("=========================================================================================\nРабота с числами\n=========================================================================================\n")
a = 2
b = 28
print (a + b)
c = (a*2+b/b)
print (c)
d= c+15
print (d)
print (math.sqrt(d))                                                    # Вычисляем квадратный корень с помощью библиотеки math
print (math.sin(d))                                                     # Вычисляем синус с помощью библиотеки math
print("=========================================================================================\nEND\n=========================================================================================\n")

print("=========================================================================================\nРабота со строчками\n=========================================================================================\n")
f_name="Dmitry"
s_name="Zarzhitsky"
t_name="aleksanrovich"
full_name=(f_name + ' ' + s_name + ' '+ t_name)
print(f_name + ' ' + s_name + ' ' + t_name)
print(f_name + ' ' + s_name + ' ' + t_name.title())                     # Все начинаются с заглавной
print(full_name.upper())                                                # Все заглавные
print(full_name.lower())                                                # Все строчные
trash="     |     ghdu Denis huev.,.,        |       "
print(trash)
print(trash.rstrip())                                                   # Удалить пробелы справа
print(trash.lstrip())                                                   # Удалить пробелы слева
print(trash.strip())                                                    # Удалить пробелы с двух сторон
print(trash.strip(" " + "|" + "," + "." + "huev" + "ghdu"))             # Удалить контент в выводе
print(str(a)+f_name)                                                    # связать цифры с именем
e=(str(a) + "_" + s_name)
print(e)
print("=========================================================================================\nEND\n=========================================================================================\n")

print("=========================================================================================\nРабота с циклами\n=========================================================================================\n")
for per01 in range(0,6):                                                # Вывести от нуля до шести (в range) для per01
    print(b)
    print(per01)
print ("END")
for per02 in range(-50,3,4):                                            # Вывести от -5 до 3 с шагом 4 (в range) для per02
    print("Number x="+ str(per02))
    if per02 == -10:                                                    # если per02 будет точно равна -40
        print("END_of_loop")
        break                                                           # Остановить программу
per03=1
while True:                                                             # Запустить и продолжить цикл пока True
    print(per03)
    per03+=1                                                            # К переменной per03 прибавлять 1
# == точно равно, != не равно, <= меньше или равно, >= больше или равно
    if per03 == 10:                                                      # если per03 не равна, то остановить
        print("END_of_loop")
        break
print("=========================================================================================\nEND\n=========================================================================================\n")

print("=========================================================================================\nРабота с массивами\n=========================================================================================\n")

cities = [ 'Kazan','Kiev', 'New York','Izhevsk', 'Sankt-Petersburg', 'Moscow', 'Perm']     # Создаем массив значений  
print(cities)                                                           # Вывод всех значений в массиве
print(len(cities))                                                      # Вывод количества значений в массиве
print(cities [0])                                                       # Вывод значения в массиве, по его порядковому номеру начиная с 0. 
# Также можно использовать отрицательный порядок для вывода с конца массива
mycities = cities[3:6]                                                  # вывести из массива с индекса 3 по 6 не включая 6 значение
print(mycities)
mycities = cities[-5:-1]
print(mycities)
print(cities [-2].upper())
mynumber_list = list(range(0, 14))
print(mynumber_list)
cities [4] = 'Ekaterinburg'                                             # Заменить в массиве значение
print(cities) 
cities.append ('Glazov')                                                # Добавить в конец массива значение
print(cities)
cities.insert (2, 'Uva')                                                # Добавить в массив значение внутри перед порядковым номером 2
print(cities)
del cities [-3]                                                         # Удалить из массива значение порядкового номера 3 с конца
for per05 in cities:
    print (per05.lower())                                               # можно использовать for для вывод значений в троку, также применяя форматирование
new_cities = [per04.upper() for per04 in cities]                        # Новая переменная, что для каждого значения в массиве применить форматирование ЗАГЛВАНЫЕ
print(new_cities)

cities.remove('Kazan')                                                  # Удалить значение из массива
print(cities)
del_cities = cities.pop()                                               # Метод pop удаляет элемент по индексу, а если не назначен, то с конца и возвращает его
print("Удалили: "+del_cities)
print(cities)
cities.sort()                                                           # Сортирует массив по наименованию
print(cities)
# так же можно указать сортировку в обратном порядке с помощью cities.sort(reverse=True) или указать вместо сорт cities.reverse()
mynumber_list.sort(reverse=True)
print(mynumber_list)
print(max(mynumber_list))                                               # Найти в массиве самое большое число
print(min(mynumber_list))                                               # Найти в массиве самое маленькое число
print(sum(mynumber_list))                                               # Найти сумму массива
mynumber_list2 = mynumber_list[:]                                       # [:] отделяет массивы по их памяти
mynumber_list2 = ['Mozhga', mynumber_list]
print(mynumber_list2)
print(mynumber_list)
print("=========================================================================================\nEND\n=========================================================================================\n")

