import modules                                                                     # мы подключили библиотку с нашими функциями
from modulehero import *                                                           # мы импортировали модуль с нашим классом героя
# Еще можно добавить модуль с помощью (from modules import * или название класса), тогда не нужно будет прописывать modules в начале функции и просто написать название функции

print("=========================================================================================\nРабота с модулями\n=========================================================================================\n")
for i in range(4, 11):                                                              # Вызовем цикл факториалов
    print("Factorial chisla "+ str(i) + "! = "+ str(modules.factorial(i)))          # цикл промежутка числа i от 4 до 20, посчитать факториал этого числа i
# Для присоедниения модуля нужно сделать Import и название файла или библиотеки в начале кода чтобы использовать его в проекте скопируем прошлый урок в отдельный файл и зададим ему имя modules
# Важно название модулей рекомендуется называть с маленькой буквы
modules.awards("Za stalina", "Volodya", "nikita", "slava")
print("===============================")
myhero1 = Hero("Jenson", 9, "Ork")
myhero2 = Hero("Quark", 5, "human")
mysuperhero = SuperHero("Googol", 24, "elf", 9)
print("===============================")
myhero1.show_hero()
myhero1.level_up()
print("===============================")
myhero2.show_hero()
myhero2.move()
myhero2.level_up()
myhero2.set_health(50)                                                              # изменим здоровье герою с помощью функции
myhero2.level_up()
print("===============================")
mysuperhero.show_hero()
mysuperhero.use_magic()
mysuperhero.magic = 10                                                              # попробуем насильно изменить количество магии
mysuperhero.show_hero()
print("=========================================================================================\nEND\n=========================================================================================\n")
